rfblue2/pic-disassembler/src/include/P16F916.INC
TXD8             EQU  H'0000'
NOT_TX8          EQU  H'0006'

TX8_9            EQU  H'0006'


;----- CMCON0 Bits -----------------------------------------------------
CIS              EQU  H'0003'
C1INV            EQU  H'0004'
C2INV            EQU  H'0005'
C1OUT            EQU  H'0006'
C2OUT            EQU  H'0007'

CM0              EQU  H'0000'
CM1              EQU  H'0001'
CM2              EQU  H'0002'


;----- VRCON Bits -----------------------------------------------------
VRR              EQU  H'0005'
VREN             EQU  H'0007'

VR0              EQU  H'0000'
VR1              EQU  H'0001'
VR2              EQU  H'0002'
VR3              EQU  H'0003'


;----- ADCON1 Bits -----------------------------------------------------
ADCS0            EQU  H'0004'
ADCS1            EQU  H'0005'
ADCS2            EQU  H'0006'


;----- WDTCON Bits -----------------------------------------------------
SWDTEN           EQU  H'0000'

SWDTE            EQU  H'0000'
WDTPS0           EQU  H'0001'
WDTPS1           EQU  H'0002'
WDTPS2           EQU  H'0003'
WDTPS3           EQU  H'0004'


;----- LCDCON Bits -----------------------------------------------------
VLCDEN           EQU  H'0004'
WERR             EQU  H'0005'
SLPEN            EQU  H'0006'
LCDEN            EQU  H'0007'

LMUX0            EQU  H'0000'
LMUX1            EQU  H'0001'
CS0              EQU  H'0002'
CS1              EQU  H'0003'


;----- LCDPS Bits -----------------------------------------------------
WA               EQU  H'0004'
LCDA             EQU  H'0005'
BIASMD           EQU  H'0006'
WFT              EQU  H'0007'

LP0              EQU  H'0000'
LP1              EQU  H'0001'
LP2              EQU  H'0002'
LP3              EQU  H'0003'


;----- LVDCON Bits -----------------------------------------------------
LVDEN            EQU  H'0004'
IRVST            EQU  H'0005'

LVDL0            EQU  H'0000'
LVDL1            EQU  H'0001'
LVDL2            EQU  H'0002'


;----- EEDATA Bits -----------------------------------------------------
EEDATL0          EQU  H'0000'
EEDATL1          EQU  H'0001'
EEDATL2          EQU  H'0002'
EEDATL3          EQU  H'0003'
EEDATL4          EQU  H'0004'
EEDATL5          EQU  H'0005'
EEDATL6          EQU  H'0006'
EEDATL7          EQU  H'0007'


;----- EEDATL Bits -----------------------------------------------------
EEDATL0          EQU  H'0000'
EEDATL1          EQU  H'0001'
EEDATL2          EQU  H'0002'
EEDATL3          EQU  H'0003'
EEDATL4          EQU  H'0004'
EEDATL5          EQU  H'0005'
EEDATL6          EQU  H'0006'
EEDATL7          EQU  H'0007'


;----- EEADR Bits -----------------------------------------------------
EEADRL0          EQU  H'0000'
EEADRL1          EQU  H'0001'
EEADRL2          EQU  H'0002'
EEADRL3          EQU  H'0003'
EEADRL4          EQU  H'0004'
EEADRL5          EQU  H'0005'
EEADRL6          EQU  H'0006'
EEADRL7          EQU  H'0007'


;----- EEADRL Bits -----------------------------------------------------
EEADRL0          EQU  H'0000'
EEADRL1          EQU  H'0001'
EEADRL2          EQU  H'0002'
EEADRL3          EQU  H'0003'
EEADRL4          EQU  H'0004'
EEADRL5          EQU  H'0005'
EEADRL6          EQU  H'0006'
EEADRL7          EQU  H'0007'


;----- EEDATH Bits -----------------------------------------------------
EEDATH0          EQU  H'0000'
EEDATH1          EQU  H'0001'
EEDATH2          EQU  H'0002'
EEDATH3          EQU  H'0003'
EEDATH4          EQU  H'0004'
EEDATH5          EQU  H'0005'


;----- EEADRH Bits -----------------------------------------------------
EEADRH0          EQU  H'0000'
EEADRH1          EQU  H'0001'
EEADRH2          EQU  H'0002'
EEADRH3          EQU  H'0003'
EEADRH4          EQU  H'0004'


;----- LCDDATA0 Bits -----------------------------------------------------
SEG0             EQU  H'0000'
SEG1             EQU  H'0001'
SEG2             EQU  H'0002'
SEG3             EQU  H'0003'
SEG4             EQU  H'0004'
SEG5             EQU  H'0005'
SEG6             EQU  H'0006'
SEG7             EQU  H'0007'

SEG0COM0         EQU  H'0000'
SEG1COM0         EQU  H'0001'
SEG2COM0         EQU  H'0002'
SEG3COM0         EQU  H'0003'
SEG4COM0         EQU  H'0004'
SEG5COM0         EQU  H'0005'
SEG6COM0         EQU  H'0006'
SEG7COM0         EQU  H'0007'

S0C0             EQU  H'0000'
S1C0             EQU  H'0001'
S2C0             EQU  H'0002'
S3C0             EQU  H'0003'
S4C0             EQU  H'0004'
S5C0             EQU  H'0005'
S6C0             EQU  H'0006'
S7C0             EQU  H'0007'


;----- LCDDATA1 Bits -----------------------------------------------------
SEG8             EQU  H'0000'
SEG9             EQU  H'0001'
SEG10            EQU  H'0002'
SEG11            EQU  H'0003'
SEG12            EQU  H'0004'
SEG13            EQU  H'0005'
SEG14            EQU  H'0006'
SEG15            EQU  H'0007'

SEG8COM0         EQU  H'0000'
SEG9COM0         EQU  H'0001'
SEG10COM0        EQU  H'0002'
SEG11COM0        EQU  H'0003'
SEG12COM0        EQU  H'0004'
SEG13COM0        EQU  H'0005'
SEG14COM0        EQU  H'0006'
SEG15COM0        EQU  H'0007'

S8C0             EQU  H'0000'
S9C0             EQU  H'0001'
S10C0            EQU  H'0002'
S11C0            EQU  H'0003'
S12C0            EQU  H'0004'
S13C0            EQU  H'0005'
S14C0            EQU  H'0006'
S15C0            EQU  H'0007'


;----- LCDDATA3 Bits -----------------------------------------------------
SEG0             EQU  H'0000'
SEG1             EQU  H'0001'
SEG2             EQU  H'0002'
SEG3             EQU  H'0003'
SEG4             EQU  H'0004'
SEG5             EQU  H'0005'
SEG6             EQU  H'0006'
SEG7             EQU  H'0007'

SEG0COM1         EQU  H'0000'
SEG1COM1         EQU  H'0001'
SEG2COM1         EQU  H'0002'
SEG3COM1         EQU  H'0003'
SEG4COM1         EQU  H'0004'
SEG5COM1         EQU  H'0005'
SEG6COM1         EQU  H'0006'
SEG7COM1         EQU  H'0007'

